FreeRTOS/FreeRTOS/FreeRTOS/Demo/RL78_E2Studio_GCC/src/iodefine/iodefine_RL78G14_ext.h
#define TRGGRDM (*(volatile unsigned short *)0xF025E)
#define TRDELC (*(volatile union un_trdelc *)0xF0260).trdelc
#define TRDELC_bit (*(volatile union un_trdelc *)0xF0260).BIT
#define TRDSTR (*(volatile unsigned char *)0xF0263)
#define TRDMR (*(volatile union un_trdmr *)0xF0264).trdmr
#define TRDMR_bit (*(volatile union un_trdmr *)0xF0264).BIT
#define TRDPMR (*(volatile union un_trdpmr *)0xF0265).trdpmr
#define TRDPMR_bit (*(volatile union un_trdpmr *)0xF0265).BIT
#define TRDFCR (*(volatile union un_trdfcr *)0xF0266).trdfcr
#define TRDFCR_bit (*(volatile union un_trdfcr *)0xF0266).BIT
#define TRDOER1 (*(volatile union un_trdoer1 *)0xF0267).trdoer1
#define TRDOER1_bit (*(volatile union un_trdoer1 *)0xF0267).BIT
#define TRDOER2 (*(volatile union un_trdoer2 *)0xF0268).trdoer2
#define TRDOER2_bit (*(volatile union un_trdoer2 *)0xF0268).BIT
#define TRDOCR (*(volatile union un_trdocr *)0xF0269).trdocr
#define TRDOCR_bit (*(volatile union un_trdocr *)0xF0269).BIT
#define TRDDF0 (*(volatile union un_trddf0 *)0xF026A).trddf0
#define TRDDF0_bit (*(volatile union un_trddf0 *)0xF026A).BIT
#define TRDDF1 (*(volatile union un_trddf1 *)0xF026B).trddf1
#define TRDDF1_bit (*(volatile union un_trddf1 *)0xF026B).BIT
#define TRDCR0 (*(volatile union un_trdcr0 *)0xF0270).trdcr0
#define TRDCR0_bit (*(volatile union un_trdcr0 *)0xF0270).BIT
#define TRDIORA0 (*(volatile union un_trdiora0 *)0xF0271).trdiora0
#define TRDIORA0_bit (*(volatile union un_trdiora0 *)0xF0271).BIT
#define TRDIORC0 (*(volatile union un_trdiorc0 *)0xF0272).trdiorc0
#define TRDIORC0_bit (*(volatile union un_trdiorc0 *)0xF0272).BIT
#define TRDSR0 (*(volatile union un_trdsr0 *)0xF0273).trdsr0
#define TRDSR0_bit (*(volatile union un_trdsr0 *)0xF0273).BIT
#define TRDIER0 (*(volatile union un_trdier0 *)0xF0274).trdier0
#define TRDIER0_bit (*(volatile union un_trdier0 *)0xF0274).BIT
#define TRDPOCR0 (*(volatile union un_trdpocr0 *)0xF0275).trdpocr0
#define TRDPOCR0_bit (*(volatile union un_trdpocr0 *)0xF0275).BIT
#define TRD0 (*(volatile unsigned short *)0xF0276)
#define TRDGRA0 (*(volatile unsigned short *)0xF0278)
#define TRDGRB0 (*(volatile unsigned short *)0xF027A)
#define TRDGRC0M (*(volatile unsigned short *)0xF027C)
#define TRDGRD0M (*(volatile unsigned short *)0xF027E)
#define TRDCR1 (*(volatile union un_trdcr1 *)0xF0280).trdcr1
#define TRDCR1_bit (*(volatile union un_trdcr1 *)0xF0280).BIT
#define TRDIORA1 (*(volatile union un_trdiora1 *)0xF0281).trdiora1
#define TRDIORA1_bit (*(volatile union un_trdiora1 *)0xF0281).BIT
#define TRDIORC1 (*(volatile union un_trdiorc1 *)0xF0282).trdiorc1
#define TRDIORC1_bit (*(volatile union un_trdiorc1 *)0xF0282).BIT
#define TRDSR1 (*(volatile union un_trdsr1 *)0xF0283).trdsr1
#define TRDSR1_bit (*(volatile union un_trdsr1 *)0xF0283).BIT
#define TRDIER1 (*(volatile union un_trdier1 *)0xF0284).trdier1
#define TRDIER1_bit (*(volatile union un_trdier1 *)0xF0284).BIT
#define TRDPOCR1 (*(volatile union un_trdpocr1 *)0xF0285).trdpocr1
#define TRDPOCR1_bit (*(volatile union un_trdpocr1 *)0xF0285).BIT
#define TRD1 (*(volatile unsigned short *)0xF0286)
#define TRDGRA1 (*(volatile unsigned short *)0xF0288)
#define TRDGRB1 (*(volatile unsigned short *)0xF028A)
#define TRDGRC1M (*(volatile unsigned short *)0xF028C)
#define TRDGRD1M (*(volatile unsigned short *)0xF028E)
#define DTCBAR (*(volatile unsigned char *)0xF02E0)
#define DTCEN0 (*(volatile union un_dtcen0 *)0xF02E8).dtcen0
#define DTCEN0_bit (*(volatile union un_dtcen0 *)0xF02E8).BIT
#define DTCEN1 (*(volatile union un_dtcen1 *)0xF02E9).dtcen1
#define DTCEN1_bit (*(volatile union un_dtcen1 *)0xF02E9).BIT
#define DTCEN2 (*(volatile union un_dtcen2 *)0xF02EA).dtcen2
#define DTCEN2_bit (*(volatile union un_dtcen2 *)0xF02EA).BIT
#define DTCEN3 (*(volatile union un_dtcen3 *)0xF02EB).dtcen3
#define DTCEN3_bit (*(volatile union un_dtcen3 *)0xF02EB).BIT
#define DTCEN4 (*(volatile union un_dtcen4 *)0xF02EC).dtcen4
#define DTCEN4_bit (*(volatile union un_dtcen4 *)0xF02EC).BIT
#define CRC0CTL (*(volatile union un_crc0ctl *)0xF02F0).crc0ctl
#define CRC0CTL_bit (*(volatile union un_crc0ctl *)0xF02F0).BIT
#define PGCRCL (*(volatile unsigned short *)0xF02F2)
#define CRCD (*(volatile unsigned short *)0xF02FA)
#define ELSELR00 (*(volatile union un_elselr00 *)0xF0300).elselr00
#define ELSELR00_bit (*(volatile union un_elselr00 *)0xF0300).BIT
#define ELSELR01 (*(volatile union un_elselr01 *)0xF0301).elselr01
#define ELSELR01_bit (*(volatile union un_elselr01 *)0xF0301).BIT
#define ELSELR02 (*(volatile union un_elselr02 *)0xF0302).elselr02
#define ELSELR02_bit (*(volatile union un_elselr02 *)0xF0302).BIT
#define ELSELR03 (*(volatile union un_elselr03 *)0xF0303).elselr03
#define ELSELR03_bit (*(volatile union un_elselr03 *)0xF0303).BIT
#define ELSELR04 (*(volatile union un_elselr04 *)0xF0304).elselr04
#define ELSELR04_bit (*(volatile union un_elselr04 *)0xF0304).BIT
#define ELSELR05 (*(volatile union un_elselr05 *)0xF0305).elselr05
#define ELSELR05_bit (*(volatile union un_elselr05 *)0xF0305).BIT
#define ELSELR06 (*(volatile union un_elselr06 *)0xF0306).elselr06
#define ELSELR06_bit (*(volatile union un_elselr06 *)0xF0306).BIT
#define ELSELR07 (*(volatile union un_elselr07 *)0xF0307).elselr07
#define ELSELR07_bit (*(volatile union un_elselr07 *)0xF0307).BIT
#define ELSELR08 (*(volatile union un_elselr08 *)0xF0308).elselr08
#define ELSELR08_bit (*(volatile union un_elselr08 *)0xF0308).BIT
#define ELSELR09 (*(volatile union un_elselr09 *)0xF0309).elselr09
#define ELSELR09_bit (*(volatile union un_elselr09 *)0xF0309).BIT
#define ELSELR10 (*(volatile union un_elselr10 *)0xF030A).elselr10
#define ELSELR10_bit (*(volatile union un_elselr10 *)0xF030A).BIT
#define ELSELR11 (*(volatile union un_elselr11 *)0xF030B).elselr11
#define ELSELR11_bit (*(volatile union un_elselr11 *)0xF030B).BIT
#define ELSELR12 (*(volatile union un_elselr12 *)0xF030C).elselr12
#define ELSELR12_bit (*(volatile union un_elselr12 *)0xF030C).BIT
#define ELSELR13 (*(volatile union un_elselr13 *)0xF030D).elselr13
#define ELSELR13_bit (*(volatile union un_elselr13 *)0xF030D).BIT
#define ELSELR14 (*(volatile union un_elselr14 *)0xF030E).elselr14
#define ELSELR14_bit (*(volatile union un_elselr14 *)0xF030E).BIT
#define ELSELR15 (*(volatile union un_elselr15 *)0xF030F).elselr15
#define ELSELR15_bit (*(volatile union un_elselr15 *)0xF030F).BIT
#define ELSELR16 (*(volatile union un_elselr16 *)0xF0310).elselr16
#define ELSELR16_bit (*(volatile union un_elselr16 *)0xF0310).BIT
#define ELSELR17 (*(volatile union un_elselr17 *)0xF0311).elselr17
#define ELSELR17_bit (*(volatile union un_elselr17 *)0xF0311).BIT
#define ELSELR18 (*(volatile union un_elselr18 *)0xF0312).elselr18
#define ELSELR18_bit (*(volatile union un_elselr18 *)0xF0312).BIT
#define ELSELR19 (*(volatile union un_elselr19 *)0xF0313).elselr19
#define ELSELR19_bit (*(volatile union un_elselr19 *)0xF0313).BIT
#define ELSELR20 (*(volatile union un_elselr20 *)0xF0314).elselr20
#define ELSELR20_bit (*(volatile union un_elselr20 *)0xF0314).BIT
#define ELSELR21 (*(volatile union un_elselr21 *)0xF0315).elselr21
#define ELSELR21_bit (*(volatile union un_elselr21 *)0xF0315).BIT
#define ELSELR22 (*(volatile union un_elselr22 *)0xF0316).elselr22
#define ELSELR22_bit (*(volatile union un_elselr22 *)0xF0316).BIT
#define ELSELR23 (*(volatile union un_elselr23 *)0xF0317).elselr23
#define ELSELR23_bit (*(volatile union un_elselr23 *)0xF0317).BIT
#define ELSELR24 (*(volatile union un_elselr24 *)0xF0318).elselr24
#define ELSELR24_bit (*(volatile union un_elselr24 *)0xF0318).BIT
#define ELSELR25 (*(volatile union un_elselr25 *)0xF0319).elselr25
#define ELSELR25_bit (*(volatile union un_elselr25 *)0xF0319).BIT
#define COMPMDR (*(volatile union un_compmdr *)0xF0340).compmdr
#define COMPMDR_bit (*(volatile union un_compmdr *)0xF0340).BIT
#define COMPFIR (*(volatile union un_compfir *)0xF0341).compfir
#define COMPFIR_bit (*(volatile union un_compfir *)0xF0341).BIT
#define COMPOCR (*(volatile union un_compocr *)0xF0342).compocr
#define COMPOCR_bit (*(volatile union un_compocr *)0xF0342).BIT
#define COMPTCR (*(volatile union un_comptcr *)0xF0343).comptcr
#define COMPTCR_bit (*(volatile union un_comptcr *)0xF0343).BIT
#define TRJ0 (*(volatile unsigned short *)0xF0500)
#define MONMOD1 (*(volatile unsigned char *)0xF0720)
#define TRCMA (*(volatile unsigned char *)0xF0721)

